mach-3-tunnel-with-step/rhoCentralFoam10/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6.0
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          200;
        startFace       8300;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       8500;
    }
    top
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          200;
        startFace       8600;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          100;
        startFace       8800;
    }
    step
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       8900;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          600;
        startFace       9100;
    }
)

// ************************************************************************* //
